Project/Toir.Adaptation/src/Reports/гкс_Бюджет/гкс_Бюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_Бюджет</name>
</mdclass:Report>

Project/Toir.Adaptation/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8cd050f-96b8-4025-804f-118eec0e9fd4">
    <name>гкс_ЭтоПереносРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешниеОснованияДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_СтатусыДокументовЗаявокУстановленные/торо_СтатусыДокументовЗаявокУстановленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c68c5be4-f678-4be9-b6b2-f8797f6543c2">
  <name>торо_СтатусыДокументовЗаявокУстановленные</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="e0b0a6b0-2b8c-4487-9308-c0cf5fda19e3">
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="154a62a5-669e-4157-ad7b-ef52e53b4721">
    <name>ИзменяемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="14bdc774-4023-4716-9f09-d781c7bbfaa3">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="b3a0ce45-03a8-440c-8d44-e71cbb504596">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e5c19e7b-9d94-485e-a787-06a5e549f3a3">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="7bae5f7e-d12f-42ac-85bb-ef8f585e5de0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c494d197-1312-4754-a0ef-be70a3b0680e">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_СтоимостьЧасаКвалификации/торо_СтоимостьЧасаКвалификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d1173aa4-d886-4d5e-bc47-eeda2d50596d">
  <name>торо_СтоимостьЧасаКвалификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="8b3bc9d7-6451-47f0-baf1-23ad0bafc53d">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ee7e8f11-c2e5-489a-9030-54b085c1e3fc">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="72bae6c2-13df-490b-a7ef-22211c8dd503">
    <name>Квалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="40f85f13-40f4-42f5-bc30-c88c55f1822f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Reports/гкс_Бюджет/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НастройкиКД = КомпоновщикНастроек.ПолучитьНастройки();
	ДопПараметры = Новый Структура("ПланДатаНачала,ПланДатаОкончания,ПоВД,ПоППР,ПоВО", Дата(1, 1, 1), Дата(3999, 1, 1), Истина, Истина, Истина);
	ДопПараметры.Вставить("АктДатаНачала", Дата(1, 1, 1));
	ДопПараметры.Вставить("АктДатаОкончания", Дата(3999, 1, 1));
	ПараметрПериодАкт = Новый ПараметрКомпоновкиДанных("АктуальныйПериод");
	ПараметрПериодПлан = Новый ПараметрКомпоновкиДанных("ПлановыйПериод");
	ПараметрПодр = Новый ПараметрКомпоновкиДанных("Подразделение");
	ПараметрСтатус = Новый ПараметрКомпоновкиДанных("СтатусСогласования");
	ПараметрПоВД = Новый ПараметрКомпоновкиДанных("ПоВД");
	ПараметрПоППР = Новый ПараметрКомпоновкиДанных("ПоППР");
	ПараметрПоВО = Новый ПараметрКомпоновкиДанных("ПоВО");
	
	Для Каждого СтрокаПараметр Из НастройкиКД.ПараметрыДанных.Элементы Цикл
		Если СтрокаПараметр.Использование Тогда
			Если СтрокаПараметр.Параметр = ПараметрПериодПлан Тогда
				ДопПараметры.ПланДатаНачала = СтрокаПараметр.Значение.ДатаНачала;
				ДопПараметры.ПланДатаОкончания = СтрокаПараметр.Значение.ДатаОкончания;
			ИначеЕсли СтрокаПараметр.Параметр = ПараметрПериодАкт Тогда
				ДопПараметры.АктДатаНачала = СтрокаПараметр.Значение.ДатаНачала;
				ДопПараметры.АктДатаОкончания = СтрокаПараметр.Значение.ДатаОкончания;
			ИначеЕсли СтрокаПараметр.Параметр = ПараметрПодр Тогда
				ДопПараметры.Вставить("Подразделение", СтрокаПараметр.Значение);
			ИначеЕсли СтрокаПараметр.Параметр = ПараметрСтатус Тогда
				ДопПараметры.Вставить("Статус", СтрокаПараметр.Значение);
			КонецЕсли;
		КонецЕсли;
		Если СтрокаПараметр.Параметр = ПараметрПоВД Тогда
			ДопПараметры.Вставить("ПоВД", СтрокаПараметр.Значение);
		ИначеЕсли СтрокаПараметр.Параметр = ПараметрПоППР Тогда
			ДопПараметры.Вставить("ПоППР", СтрокаПараметр.Значение);
		ИначеЕсли СтрокаПараметр.Параметр = ПараметрПоВО Тогда
			ДопПараметры.Вставить("ПоВО", СтрокаПараметр.Значение);
		КонецЕсли;
	КонецЦикла;
	////
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешниеНаборыДанных = Новый Структура("ТабДанных1", ПолучитьОсновнуюТаблицу(ДопПараметры));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКД, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
	// обойти и схлопнуть ячейки
	НомерКолонки = 1;
	ВертикальноеТерпение = 10;
	
	НомерСтроки = 1;
	НомерПервой = 0;
	НомерПоследней = 0;
	Пока ВертикальноеТерпение > 0 Цикл
		ЭтоПустая = Истина;
		ТекстКолонки = ДокументРезультат.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст;
		ЭтоПустая = Не ЗначениеЗаполнено(ТекстКолонки);
		Если ЭтоПустая Тогда 
			ВертикальноеТерпение = ВертикальноеТерпение - 1;
			Если НомерПоследней > 0 Тогда 
				Сч = 1;
				Пока Сч < 34 Цикл
					ДокументРезультат.Область(НомерПервой, Сч, НомерПоследней, Сч).Объединить();
					Сч = Сч + 1;
					Если Сч = 20 Тогда 
						Сч = 33;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			НомерПоследней = 0;
		Иначе    
			ВертикальноеТерпение = 10;
			Если ТекстКолонки = "&+" Тогда 
				НомерПоследней = НомерСтроки;
			Иначе
				Если НомерПоследней > 0 Тогда 
					Сч = 1;
					Пока Сч < 34 Цикл
						ДокументРезультат.Область(НомерПервой, Сч, НомерПоследней, Сч).Объединить();
						Сч = Сч + 1;
						Если Сч = 20 Тогда 
							Сч = 33;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				НомерПервой = НомерСтроки;
				НомерПоследней = 0;
			КонецЕсли;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
		
КонецПроцедуры


Функция ПолучитьОсновнуюТаблицу(ДопПараметры)
	#Область ПостроениеТаблицы
	ОпТипПриоритет = Новый ОписаниеТипов("СправочникСсылка.торо_КатегорииРиска");
	ОпТипОР = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта");
	ОпТипВР = Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов");
	ОпТипПодр = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ОпТипОрг = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ОпТипСогл = Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот");
	ОпТипСмета = Новый ОписаниеТипов("ДокументСсылка.торо_ЗаявкаНаРемонт");
	ОпТипНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ОпТипКвалификация = Новый ОписаниеТипов("СправочникСсылка.торо_КвалификацииРемонтногоПерсонала");
	
	ОпТипСпособСогл = Новый ОписаниеТипов("СправочникСсылка.торо_СпособыСогласованияДокументов");
	
	МассТипов = Новый Массив();
	МассТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассТипов.Добавить(Тип("ДокументСсылка.торо_ПланГрафикРемонта"));
	ОпТипОснование = Новый ОписаниеТипов(МассТипов);
	ОпТипСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОпТипСтрока36 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(36));
	ОпТипСтрока16 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(16));
	ОпТипСтрока = Новый ОписаниеТипов("Строка");
	ОпТипБулево = Новый ОписаниеТипов("Булево");
	ОпТипДата = Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ОпТипЧисло15_2 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2));
	//
	Таб = Новый ТаблицаЗначений();
	Таб.Колонки.Добавить("ДокОсн", ОпТипОснование);
	Таб.Колонки.Добавить("КоммОсн", ОпТипСтрока);
	Таб.Колонки.Добавить("НомерСметы", ОпТипСтрока16);
	Таб.Колонки.Добавить("Ссылка", ОпТипСмета);
	Таб.Колонки.Добавить("Организация", ОпТипОрг);
	Таб.Колонки.Добавить("Подразделение", ОпТипПодр);
	Таб.Колонки.Добавить("НуженОстанов", ОпТипБулево);
	Таб.Колонки.Добавить("СпособСогл", ОпТипСпособСогл);
	Таб.Колонки.Добавить("СтатусСогл", ОпТипСогл);
	Таб.Колонки.Добавить("КоммСметы", ОпТипСтрока);
	Таб.Колонки.Добавить("ОР", ОпТипОР);
	Таб.Колонки.Добавить("ВР", ОпТипВР);
	Таб.Колонки.Добавить("Описание", ОпТипСтрока);
	Таб.Колонки.Добавить("ПланДатаНачала", ОпТипДата);
	Таб.Колонки.Добавить("ПланДатаОкончания", ОпТипДата);
	Таб.Колонки.Добавить("АктДатаНачала", ОпТипДата);
	Таб.Колонки.Добавить("АктДатаОкончания", ОпТипДата);
	Таб.Колонки.Добавить("ПланСтоимость", ОпТипСтрока16);
	Таб.Колонки.Добавить("Валюта", ОпТипСтрока16);
	Таб.Колонки.Добавить("Номенклатура", ОпТипНоменклатура);
	Таб.Колонки.Добавить("КодНом", ОпТипСтрока16);
	Таб.Колонки.Добавить("ЕдИзмНом", ОпТипСтрока16);
	Таб.Колонки.Добавить("ЦенаНом", ОпТипСтрока16);
	Таб.Колонки.Добавить("КолвоНом", ОпТипСтрока16);
	Таб.Колонки.Добавить("СуммаНом", ОпТипСтрока16);
	Таб.Колонки.Добавить("ДавальческийНом", ОпТипБулево);
	Таб.Колонки.Добавить("Квал", ОпТипСтрока16);
	Таб.Колонки.Добавить("КодКвал", ОпТипСтрока16);
	Таб.Колонки.Добавить("Трудоемкость", ОпТипСтрока16);
	Таб.Колонки.Добавить("ЦенаКвал", ОпТипСтрока16);
	Таб.Колонки.Добавить("СуммаКвал", ОпТипСтрока16);
	Таб.Колонки.Добавить("Исполнитель", ОпТипСтрока150);
	Таб.Колонки.Добавить("Ответственный", ОпТипСтрока150);
	//
	Таб.Колонки.Добавить("СпособСоглТекст", ОпТипСтрока150);
	Таб.Колонки.Добавить("СтатусСоглТекст", ОпТипСтрока150);
	Таб.Колонки.Добавить("СтатусСметыТекст", ОпТипСтрока150);
	Таб.Колонки.Добавить("НуженОстановТекст", ОпТипСтрока16);
	Таб.Колонки.Добавить("ДокОснТекст", ОпТипСтрока150);
	
	                    	
	#КонецОбласти
	//
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сметы.Ссылка КАК Ссылка,
		|	Сметы.ДатаНачала КАК ДатаНачала,
		|	Сметы.ДатаОкончания КАК ДатаОкончания,
		|	Сметы.ОписаниеРемонта КАК ОписаниеРемонта,
		|	Сметы.ОбъектРемонта КАК ОбъектРемонта,
		|	Сметы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ЕСТЬNULL(Рег.ДатаНачала, Сметы.ДатаНачала) КАК АктДатаНачала,
		|	ЕСТЬNULL(Рег.ДатаОкончания, Сметы.ДатаОкончания) КАК АктДатаОкончания,
		|	Сметы.Ссылка.Организация.гкс_ВидЦены.ВалютаЦены КАК ОргВалюта,
		|	Сметы.Ссылка.Организация.гкс_ВидЦены КАК ВидЦены,
		|	Сметы.ID КАК ИД_Ремонта
		|ПОМЕСТИТЬ ВсеРемонты
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК Сметы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК Рег
		|		ПО Сметы.ID = Рег.IDРемонта
		|ГДЕ
		|	Сметы.Ссылка.Проведен
		|	И Сметы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Сметы.ДатаНачала >= &ПланДатаНачала
		|	И Сметы.ДатаНачала < &ПланДатаОкончания
		|	И ЕСТЬNULL(Рег.ДатаНачала, Сметы.ДатаНачала) >= &АктДатаНачала
		|	И ЕСТЬNULL(Рег.ДатаНачала, Сметы.ДатаНачала) < &АктДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сметы.Ссылка.Номер КАК НомерСметы,
		|	Сметы.Ссылка КАК Ссылка,
		|	Сметы.Ссылка.Организация КАК Организация,
		|	Сметы.Ссылка.Подразделение КАК Подразделение,
		|	Сметы.Ссылка.Комментарий КАК КоммСметы,
		|	Сметы.Ссылка.Ответственный КАК Ответственный,
		|	Сметы.Ссылка.СпособСогласования КАК СпособСогл,
		|	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК СтатусСогл,
		|	торо_СтатусыДокументов.СтатусДокумента КАК СтатусСметы,
		|	Сметы.Ссылка.гкс_НуженОстанов КАК НуженОстанов,
		|	Сметы.Ссылка.гкс_Валюта КАК Валюта,
		|	Сметы.ДатаНачала КАК ДатаНачала,
		|	Сметы.ДатаОкончания КАК ДатаОкончания,
		|	Сметы.ОписаниеРемонта КАК ОписаниеРемонта,
		|	Сметы.ОбъектРемонта КАК ОбъектРемонта,
		|	Сметы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	Сметы.АктДатаНачала КАК АктДатаНачала,
		|	Сметы.АктДатаОкончания КАК АктДатаОкончания,
		|	Сметы.ИД_Ремонта КАК ИД_Ремонта,
		|	ЕСТЬNULL(ВнешниеО.Регистратор, ЕСТЬNULL(Дефекты.Регистратор, ППР.Регистратор)) КАК ДокОсн
		|ПОМЕСТИТЬ ВсеРемонты2
		|ИЗ
		|	ВсеРемонты КАК Сметы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот) КАК ВнешниеО
		|		ПО Сметы.ИД_Ремонта = ВнешниеО.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних КАК Дефекты
		|		ПО Сметы.ИД_Ремонта = Дефекты.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК ППР
		|		ПО Сметы.ИД_Ремонта = ППР.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
		|		ПО (торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = Сметы.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные.СрезПоследних КАК торо_СтатусыДокументов
		|		ПО Сметы.Ссылка = торо_СтатусыДокументов.ИзменяемыйДокумент
		|ГДЕ
		|	ИСТИНА
		|	И &Отбор1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеРемонты.Ссылка КАК Ссылка,
		|	ВсеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ВсеРемонты.ОргВалюта КАК ОргВалюта,
		|	ВсеРемонты.ВидЦены КАК ВидЦены
		|ПОМЕСТИТЬ УникальныеРемонты
		|ИЗ
		|	ВсеРемонты КАК ВсеРемонты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеРемонты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеРемонты.НомерСметы КАК НомерСметы,
		|	ВсеРемонты.Ссылка КАК Ссылка,
		|	ВсеРемонты.Организация КАК Организация,
		|	ВсеРемонты.Организация.гкс_ВидЦены.ВалютаЦены КАК ОргВалюта,
		|	ВсеРемонты.Подразделение КАК Подразделение,
		|	ВсеРемонты.КоммСметы КАК КоммСметы,
		|	ВсеРемонты.Ответственный КАК Ответственный,
		|	ВсеРемонты.СпособСогл КАК СпособСогл,
		|	ВсеРемонты.СтатусСметы КАК СтатусСметы,
		|	ВсеРемонты.НуженОстанов КАК НуженОстанов,
		|	ВсеРемонты.Валюта КАК Валюта,
		|	ВсеРемонты.ДатаНачала КАК ПланДатаНачала,
		|	ВсеРемонты.ДатаОкончания КАК ПланДатаОкончания,
		|	ВсеРемонты.ОписаниеРемонта КАК Описание,
		|	ВсеРемонты.ОбъектРемонта КАК ОР,
		|	ВсеРемонты.ВидРемонтныхРабот КАК ВР,
		|	ВсеРемонты.АктДатаНачала КАК АктДатаНачала,
		|	ВсеРемонты.АктДатаОкончания КАК АктДатаОкончания,
		|	ВсеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ВсеРемонты.ДокОсн КАК ДокОсн,
		|	ВсеРемонты.ДокОсн.Комментарий КАК КоммОсн,
		|	ВсеРемонты.СтатусСогл КАК СтатусСогл
		|ИЗ
		|	ВсеРемонты2 КАК ВсеРемонты
		|ИТОГИ ПО
		|	Ссылка,
		|	ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеРемонты2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧТовары.РемонтыОборудования_ID КАК ИД_Ремонта,
		|	ТЧТовары.Ссылка КАК Ссылка,
		|	ТЧТовары.Количество КАК КолвоНом,
		|	ТЧТовары.гкс_Давальческие КАК ДавальческийНом,
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Номенклатура.Код КАК КодНом,
		|	УникальныеРемонты.ОргВалюта КАК ОргВалюта,
		|	УникальныеРемонты.ВидЦены КАК ВидЦены,
		|	ТЧТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзмНом
		|ПОМЕСТИТЬ ВТ_ВсеМЗ
		|ИЗ
		|	УникальныеРемонты КАК УникальныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК ТЧТовары
		|		ПО УникальныеРемонты.Ссылка = ТЧТовары.Ссылка
		|			И УникальныеРемонты.ИД_Ремонта = ТЧТовары.РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧТовары.ИД_Ремонта КАК ИД_Ремонта,
		|	ТЧТовары.Ссылка КАК Ссылка,
		|	ТЧТовары.КолвоНом КАК КолвоНом,
		|	ТЧТовары.ДавальческийНом КАК ДавальческийНом,
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.КодНом КАК КодНом,
		|	ЕСТЬNULL(Цены.Цена, 0) КАК ЦенаНом,
		|	ТЧТовары.ЕдИзмНом КАК ЕдИзмНом
		|ИЗ
		|	ВТ_ВсеМЗ КАК ТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК Цены
		|		ПО (Цены.Номенклатура = ТЧТовары.Номенклатура)
		|			И (Цены.Валюта = ТЧТовары.ОргВалюта)
		|			И (Цены.ВидЦены = ТЧТовары.ВидЦены)
		|ИТОГИ ПО
		|	Ссылка,
		|	ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УникальныеРемонты.Ссылка КАК Ссылка,
		|	УникальныеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ТЧСотрудники.Квалификация КАК Квал,
		|	ТЧСотрудники.Квалификация.Код КАК КодКвал,
		|	ТЧСотрудники.Количество КАК КолвоКвал,
		|	ТЧСотрудники.ВремяРаботы КАК ВремяРаботы
		|ИЗ
		|	УникальныеРемонты КАК УникальныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК ТЧСотрудники
		|		ПО УникальныеРемонты.Ссылка = ТЧСотрудники.Ссылка
		|			И УникальныеРемонты.ИД_Ремонта = ТЧСотрудники.РемонтыОборудования_ID
		|ИТОГИ ПО
		|	Ссылка,
		|	ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УникальныеРемонты.Ссылка КАК Ссылка,
		|	УникальныеРемонты.ИД_Ремонта КАК ИД_Ремонта,
		|	ТЧИсполнители.Исполнитель КАК Исполнитель
		|ИЗ
		|	УникальныеРемонты КАК УникальныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ТЧИсполнители
		|		ПО УникальныеРемонты.Ссылка = ТЧИсполнители.Ссылка
		|			И УникальныеРемонты.ИД_Ремонта = ТЧИсполнители.РемонтыОборудования_ID
		|ИТОГИ ПО
		|	Ссылка,
		|	ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Квалификация КАК Квал,
		|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Валюта КАК Валюта,
		|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость КАК Стоимость
		|ИЗ
		|	РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних(, ) КАК торо_СтоимостьЧасаКвалификацииСрезПоследних";
	
	Запрос.УстановитьПараметр("ПланДатаНачала", ДопПараметры.ПланДатаНачала);
	Запрос.УстановитьПараметр("ПланДатаОкончания", ДопПараметры.ПланДатаОкончания);
	Запрос.УстановитьПараметр("АктДатаНачала", ДопПараметры.АктДатаНачала);
	Запрос.УстановитьПараметр("АктДатаОкончания", ДопПараметры.АктДатаОкончания);
	МассивОтбора = Новый Массив();
	Если ДопПараметры.ПоВД Тогда 
		МассивОтбора.Добавить("Не Дефекты.ID есть NULL");
	КонецЕсли;
	Если ДопПараметры.ПоВО Тогда 
		МассивОтбора.Добавить("Не ВнешниеО.ID есть NULL");
	КонецЕсли;
	Если ДопПараметры.ПоППР Тогда 
		МассивОтбора.Добавить("Не ППР.ID есть NULL");
	КонецЕсли;
	Если МассивОтбора.Количество() Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Отбор1", " И (" + СтрСоединить(МассивОтбора, " ИЛИ ") + ") И &Отбор1");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Отбор1", " И Ложь И &Отбор1");
	КонецЕсли;
	//Если ДопПараметры.Свойство("Подразделение") Тогда 
	//	Запрос.УстановитьПараметр("Подразделение", ДопПараметры.Подразделение);
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор1", "РемонтыЗаявки.Ссылка.Подразделение В (&Подразделение)");
	//Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор1", "Истина");
	//КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Отбор1", " ");
	
	#КонецОбласти
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	НомерРем = 4;
	НомерМЗ = 7;
	НомерТЗ = 8;
	НомерИсп = 9;
	НомерКвал = 10;
	
	ВыборкаРем1 = РезультатЗапроса[НомерРем].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаМЗ1 = РезультатЗапроса[НомерМЗ].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЗ1 = РезультатЗапроса[НомерТЗ].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИсп1 = РезультатЗапроса[НомерИсп].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКвал = РезультатЗапроса[НомерКвал].Выбрать(); // стоимость квалификаций
	// Курс валют не смотрим
	Пока ВыборкаРем1.Следующий() Цикл
		ВыборкаМЗ1.Сбросить();
		Если ВыборкаМЗ1.НайтиСледующий(Новый Структура("Ссылка", ВыборкаРем1.Ссылка)) Тогда 
			ВыборкаМЗ2 = ВыборкаМЗ1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			ВыборкаМЗ2 = Неопределено;
		КонецЕсли;
		ВыборкаТЗ1.Сбросить();
		Если ВыборкаТЗ1.НайтиСледующий(Новый Структура("Ссылка", ВыборкаРем1.Ссылка)) Тогда 
			ВыборкаТЗ2 = ВыборкаТЗ1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			ВыборкаТЗ2 = Неопределено;
		КонецЕсли;
		ВыборкаИсп1.Сбросить();
		Если ВыборкаИсп1.НайтиСледующий(Новый Структура("Ссылка", ВыборкаРем1.Ссылка)) Тогда 
			ВыборкаИсп2 = ВыборкаИсп1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			ВыборкаИсп2 = Неопределено;
		КонецЕсли;
		ВыборкаРем2 = ВыборкаРем1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРем2.Следующий() Цикл
			ВыборкаРем = ВыборкаРем2.Выбрать();
			ВыборкаРем.Следующий(); // для каждого ремонта только одна строка. чтобы небыло дублей
			МассМЗ = Новый Массив(); // Таблица материалов
			МассТЗ = Новый Массив(); // Таблица трудовых
			МассИсп = Новый Массив(); // Таблица исполнителей
			Если Не ВыборкаМЗ2 = Неопределено Тогда 
				ВыборкаМЗ2.Сбросить();
				Если ВыборкаМЗ2.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
					ВыборкаМЗ = ВыборкаМЗ2.Выбрать();
					Пока ВыборкаМЗ.Следующий() Цикл
						ЭтоПерваяНоменклатура = Истина;
						СтрокаТаблицы = ПолучитьСтрокуМЗ();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаМЗ);
						СтрокаТаблицы.СуммаНом = ВыборкаМЗ.ЦенаНом * ВыборкаМЗ.КолвоНом;
						Для Каждого СтрокаМассива Из МассМЗ Цикл
							Если СтрокаМассива.Номенклатура = ВыборкаМЗ.Номенклатура Тогда 
								СтрокаМассива.СуммаНом = СтрокаМассива.СуммаНом + СтрокаТаблицы.СуммаНом;
								СтрокаМассива.КолвоНом = СтрокаМассива.КолвоНом + СтрокаТаблицы.КолвоНом;
								ЭтоПерваяНоменклатура = Ложь;
							КонецЕсли;
						КонецЦикла;
						Если ЭтоПерваяНоменклатура Тогда 
							МассМЗ.Добавить(СтрокаТаблицы);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Если Не ВыборкаТЗ2 = Неопределено Тогда 
				ВыборкаТЗ2.Сбросить();
				Если ВыборкаТЗ2.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
					ВыборкаТЗ = ВыборкаТЗ2.Выбрать();
					Пока ВыборкаТЗ.Следующий() Цикл
						СтрокаТаблицы = ПолучитьСтрокуТЗ();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаТЗ);
						СтрокаТаблицы.Трудоемкость = ВыборкаТЗ.КолвоКвал * (ВыборкаТЗ.ВремяРаботы / 3600);
						ВыборкаКвал.Сбросить();
						Если ВыборкаКвал.НайтиСледующий(Новый Структура("Квал,Валюта", ВыборкаТЗ.Квал, ВыборкаРем.ОргВалюта)) Тогда 
							СтрокаТаблицы.СуммаКвал = СтрокаТаблицы.Трудоемкость * ВыборкаКвал.Стоимость;
							СтрокаТаблицы.ЦенаКвал = ВыборкаКвал.Стоимость;
						КонецЕсли;
						ЭтоПерваяКвалификация = Истина;
						Для Каждого СтрокаМассива Из МассТЗ Цикл
							Если СтрокаМассива.Квал = ВыборкаТЗ.Квал Тогда 
								СтрокаМассива.СуммаКвал = СтрокаМассива.СуммаКвал + СтрокаТаблицы.СуммаКвал;
								СтрокаМассива.Трудоемкость = СтрокаМассива.Трудоемкость + СтрокаТаблицы.Трудоемкость;
								ЭтоПерваяКвалификация = Ложь;
							КонецЕсли;
						КонецЦикла;
						Если ЭтоПерваяКвалификация Тогда 
							МассТЗ.Добавить(СтрокаТаблицы);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Если Не ВыборкаИсп2 = Неопределено Тогда 
				ВыборкаИсп2.Сбросить();
				Если ВыборкаИсп2.НайтиСледующий(Новый Структура("ИД_Ремонта", ВыборкаРем.ИД_Ремонта)) Тогда 
					ВыборкаИсп = ВыборкаИсп2.Выбрать();
					Пока ВыборкаИсп.Следующий() Цикл
						СтрокаТаблицы = ПолучитьСтрокуИсп();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаИсп);
						МассИсп.Добавить(СтрокаТаблицы);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			СуммаРемонта = 0;
			Для Каждого СтрокаМассива Из МассТЗ Цикл
				СуммаРемонта = СуммаРемонта + СтрокаМассива.СуммаКвал;
			КонецЦикла;
			Для Каждого СтрокаМассива Из МассМЗ Цикл
				СуммаРемонта = СуммаРемонта + СтрокаМассива.СуммаНом;
			КонецЦикла;
			МаксСтрок = Макс(МассМЗ.Количество(), МассТЗ.Количество(), МассИсп.Количество());
			// Заполняем паралельные таблицы в строках
			Пока МаксСтрок > МассТЗ.Количество() Цикл
				МассТЗ.Добавить(ПолучитьСтрокуТЗ());
			КонецЦикла;
			Пока МаксСтрок > МассМЗ.Количество() Цикл
				МассМЗ.Добавить(ПолучитьСтрокуМЗ());
			КонецЦикла;
			Пока МаксСтрок > МассИсп.Количество() Цикл
				МассИсп.Добавить(ПолучитьСтрокуИсп());
			КонецЦикла;
			ПерваяСтрока = Неопределено;
			Если МаксСтрок > 0 Тогда 
				Для Сч = 1 По МаксСтрок Цикл
					СтрТаб = Таб.Добавить();
					// без схлопывания
					ЗаполнитьЗначенияСвойств(СтрТаб, ВыборкаРем);
					СтрТаб.ДокОснТекст = Строка(ВыборкаРем.ДокОсн);
					СтрТаб.СпособСоглТекст = Строка(ВыборкаРем.СпособСогл);
					Если ЗначениеЗаполнено(ВыборкаРем.СтатусСогл) Тогда 
						СтрТаб.СтатусСоглТекст = Строка(ВыборкаРем.СтатусСогл);
					Иначе
						СтрТаб.СтатусСоглТекст = "Черновик";
					КонецЕсли;
					Если ЗначениеЗаполнено(ВыборкаРем.СтатусСметы) Тогда 
						СтрТаб.СтатусСметыТекст = Строка(ВыборкаРем.СтатусСметы);
					Иначе
						СтрТаб.СтатусСметыТекст = "Черновик";
					КонецЕсли;
					СтрТаб.НуженОстановТекст = Строка(ВыборкаРем.НуженОстанов);
					СтрТаб.ПланСтоимость = СуммаРемонта;
					// для схлопывания
					//Если Сч = 1 Тогда 
					//	ПерваяСтрока = СтрТаб;
					//Иначе
					//	СтрТаб.ДокОснТекст = "&+";
					//КонецЕсли;
					
					СтрМЗ = МассМЗ[Сч - 1];
					СтрТЗ = МассТЗ[Сч - 1];
					СтрИсп = МассИсп[Сч - 1];
					ЗаполнитьЗначенияСвойств(СтрТаб, СтрМЗ);
					ЗаполнитьЗначенияСвойств(СтрТаб, СтрТЗ);
					ЗаполнитьЗначенияСвойств(СтрТаб, СтрИсп);
					Если ЗначениеЗаполнено(СтрТЗ.Квал) Тогда 
						СтрТаб.Трудоемкость = Формат(СтрТЗ.Трудоемкость, "ЧДЦ=2");
						СтрТаб.ЦенаКвал = Формат(СтрТЗ.ЦенаКвал, "ЧДЦ=2");
						СтрТаб.СуммаКвал = Формат(СтрТЗ.СуммаКвал, "ЧДЦ=2");
					Иначе
						СтрТаб.Трудоемкость = "";
						СтрТаб.ЦенаКвал = "";
						СтрТаб.СуммаКвал = "";
					КонецЕсли;
				КонецЦикла;
			Иначе
				ПерваяСтрока = Таб.Добавить();
			КонецЕсли;
			// для схлопывания
			//СтрТаб = ПерваяСтрока;
			//ЗаполнитьЗначенияСвойств(СтрТаб, ВыборкаРем);
			//СтрТаб.ДокОснТекст = Строка(ВыборкаРем.ДокОсн);
			//СтрТаб.СпособСоглТекст = Строка(ВыборкаРем.СпособСогл);
			//Если ЗначениеЗаполнено(ВыборкаРем.СтатусСогл) Тогда 
			//	СтрТаб.СтатусСоглТекст = Строка(ВыборкаРем.СтатусСогл);
			//Иначе
			//	СтрТаб.СтатусСоглТекст = "Черновик";
			//КонецЕсли;
			//Если ЗначениеЗаполнено(ВыборкаРем.СтатусСметы) Тогда 
			//	СтрТаб.СтатусСметыТекст = Строка(ВыборкаРем.СтатусСметы);
			//Иначе
			//	СтрТаб.СтатусСметыТекст = "Черновик";
			//КонецЕсли;
			//СтрТаб.НуженОстановТекст = Строка(ВыборкаРем.НуженОстанов);
			//СтрТаб.ПланСтоимость = СуммаРемонта;
		КонецЦикла;
	КонецЦикла;
	//
	Возврат Таб;
КонецФункции

Функция ПолучитьСтрокуМЗ()
	Возврат Новый Структура("Номенклатура,КодНом,ЕдИзмНом,ЦенаНом,КолвоНом,СуммаНом,ДавальческийНом", "", "", "", "", "", "", Ложь);
КонецФункции

Функция ПолучитьСтрокуТЗ()
	Возврат Новый Структура("Квал,КодКвал,Трудоемкость,ЦенаКвал,СуммаКвал", "", "", 0, 0, 0);
КонецФункции

Функция ПолучитьСтрокуИсп()
	Возврат Новый Структура("Исполнитель", "");
КонецФункции
